Documents/ПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеБезналичныхДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гф_ИсторияИзмененияБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ИсторияИзмененияБонусов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПороговоеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бонус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеБезналичныхДенежныхСредств/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// предварительно очищаем записи в регистре
	НаборЗаписей = РегистрыНакопления.гф_БонусыКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать();
	
	//2.2.1.1.	Вид операции = Поступление оплаты от клиента
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
		Возврат;
	КонецЕсли;
	
	ЦифровойКодВалюты = "978";
	гф_Валюта = Справочники.Валюты.НайтиПоКоду(ЦифровойКодВалюты);
	СтруктураКурса = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(гф_Валюта, Дата);
	КурсВалюты = СтруктураКурса.КурсЧислитель;
	
	Для Каждого СтрокаТЧ Из РасшифровкаПлатежа Цикл
		
		//2.2.1.2.	Договор.Сезон.Применять_бонусы = истина
		
		// vvv Галфинд \ Sakovich 16.08.2023
		// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee3a80a243e942
		// СтрокаТЧ.ОснованиеПлатежа - составного типа (не только Справочник.ДоговорыКонтрагентов...)

		//Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ОснованиеПлатежа) Тогда
		//	Продолжить;
		//КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ОснованиеПлатежа.гф_Сезон) Тогда
		//	Продолжить;
		//КонецЕсли;
		//Если НЕ СтрокаТЧ.ОснованиеПлатежа.гф_Сезон.гф_ПрименятьБонусы Тогда
		//	Продолжить;
		//КонецЕсли;
		//
		//Сезон = СтрокаТЧ.ОснованиеПлатежа.гф_Сезон;
		ДоговорТЧ = ОпределитьДоговорКонтрагентаВСтрокеТЧ(СтрокаТЧ);
		Если Не (ЗначениеЗаполнено(ДоговорТЧ) И ТипЗнч(ДоговорТЧ) = Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
			Продолжить;
		КонецЕсли;
		Сезон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорТЧ, "гф_Сезон");
		Если НЕ (ЗначениеЗаполнено(Сезон) И ТипЗнч(Сезон) = Тип("СправочникСсылка.КоллекцииНоменклатуры")) Тогда
			Продолжить;
		КонецЕсли;
		ПрименятьБонусы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сезон, "гф_ПрименятьБонусы");
		Если Не ПрименятьБонусы Тогда
			Продолжить;
		КонецЕсли;
		// ^^^ Галфинд \ Sakovich 16.08.2023
		
		СтруктураБонусЗаКурс = НайтиБонусПоИстории(Сезон, Справочники.гф_ВидыБонусов.БонусЗаКурс);
		СтруктураБонусЗаРаннююОплату = НайтиБонусПоИстории(Сезон, Справочники.гф_ВидыБонусов.БонусЗаРаннююОплату);
		
		//2.2.1.3.	Договор.ДопРеквизит.Количество дней отсрочки платежа (гф_ДоговорыКонтрагентовКоличествоДнейОтсрочкиПлатежа) > 0
		
		// vvv Галфинд \ Sakovich 16.08.2023
		//ДнейОтсрочкиПлатежа = НайтиКоличествоДнейОтсрочкиПлатежа(СтрокаТЧ.ОснованиеПлатежа);
		ДнейОтсрочкиПлатежа = НайтиКоличествоДнейОтсрочкиПлатежа(ДоговорТЧ);
		// ^^^ Галфинд \ Sakovich 16.08.2023
		Если ДнейОтсрочкиПлатежа <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//СП - сумма платежа. Сумма, указанная в документе «Поступление безналичных ДС»
		СП = СтрокаТЧ.Сумма;
		
		//СПЗ - сумма просроченной задолженности. Задолженность на дату «Поступление безналичных ДС», для которой крайняя дата оплаты (РТУ.Свойства.Срок платежа) < даты «Поступление безналичных ДС».
		// vvv Галфинд \ Sakovich 16.08.2023
		//СПЗ = НайтиСПЗ(Контрагент, СтрокаТЧ.ОснованиеПлатежа);
		СПЗ = НайтиСПЗ(Контрагент, ДоговорТЧ);
		// ^^^ Галфинд \ Sakovich 16.08.2023
		
		// ++ Галфинд СадомцевСА 04.08.2023 Исправил "ошибку" СонарКуба
		СНПЗ = 0;
		// vvv Галфинд \ Sakovich 16.08.2023
		//ДобавитьБонусЗаРаннююОплату(СтруктураБонусЗаРаннююОплату, СтрокаТЧ, КурсВалюты, СПЗ);
		ДобавитьБонусЗаРаннююОплату(СтруктураБонусЗаРаннююОплату, СтрокаТЧ, КурсВалюты, СПЗ, ДоговорТЧ);
		// ^^^ Галфинд \ Sakovich 16.08.2023
		
		//Если СтруктураБонусЗаРаннююОплату <> Неопределено Тогда
		//	//СНПЗ - Задолженность, у которой РТУ.Свойства.Срок платежа >= даты Поступление безналичных ДС,
		//	//И (РТУ.Свойства.Срок платежа - РегистрСведений.гф_ИсторияИзмененияБонусов. Пороговое значение, дни/руб) <= дата ППВ
		//	СНПЗ = НайтиСНПЗ(Контрагент, СтрокаТЧ.ОснованиеПлатежа, СтруктураБонусЗаРаннююОплату);
		//	
		//	БонусЗаРаннююОплату = (СтрокаТЧ.Сумма - СПЗ - СНПЗ) * СтруктураБонусЗаРаннююОплату.Значение / 100;
		//	Если БонусЗаРаннююОплату > 0 Тогда
		//		нз = Движения.гф_БонусыКлиентов.ДобавитьПриход();
		//		нз.Период = Дата;
		//		нз.Организация = Организация;
		//		нз.Контрагент = Контрагент;
		//		нз.Договор = СтрокаТЧ.ОснованиеПлатежа;
		//		нз.ВидБонуса = Справочники.гф_ВидыБонусов.БонусЗаРаннююОплату;
		//		нз.Сумма = БонусЗаРаннююОплату;
		//		нз.КурсЕвро = КурсВалюты;
		//		нз.СПЗ = СПЗ;
		//		нз.СНПЗ = СНПЗ;
		//	КонецЕсли;
		//КонецЕсли;
		
		// vvv Галфинд \ Sakovich 16.08.2023
		//ДобавитьБонусЗаКурс(СтруктураБонусЗаКурс, СтрокаТЧ, КурсВалюты, СПЗ, СНПЗ);
		ДобавитьБонусЗаКурс(СтруктураБонусЗаКурс, СтрокаТЧ, КурсВалюты, СПЗ, СНПЗ, ДоговорТЧ);
		// ^^^ Галфинд \ Sakovich 16.08.2023
		
		//Если СтруктураБонусЗаКурс <> Неопределено Тогда
		//	Если КурсВалюты < СтруктураБонусЗаКурс.ПороговоеЗначение Тогда
		//		БонусЗаКурс = (СтрокаТЧ.Сумма - СПЗ) * СтруктураБонусЗаКурс.Значение / 100;
		//		Если БонусЗаКурс > 0 Тогда
		//			нз = Движения.гф_БонусыКлиентов.ДобавитьПриход();
		//			нз.Период = Дата;
		//			нз.Организация = Организация;
		//			нз.Контрагент = Контрагент;
		//			нз.Договор = СтрокаТЧ.ОснованиеПлатежа;
		//			нз.ВидБонуса = Справочники.гф_ВидыБонусов.БонусЗаКурс;
		//			нз.Сумма = БонусЗаКурс;
		//			нз.КурсЕвро = КурсВалюты;
		//			нз.СПЗ = СПЗ;
		//			нз.СНПЗ = СНПЗ;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЦикла;
	
	Если Движения.гф_БонусыКлиентов.Количество() > 0 Тогда
		Движения.гф_БонусыКлиентов.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиКоличествоДнейОтсрочкиПлатежа(Договор)
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат 0;
	КонецЕсли;
	ДопРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул",
		"гф_ДоговорыКонтрагентовКоличествоДнейОтсрочкиПлатежа");
	КоличествоДнейОтсрочкиПлатежа = УправлениеСвойствами.ЗначениеСвойства(Договор, ДопРеквизит);
	Если ЗначениеЗаполнено(КоличествоДнейОтсрочкиПлатежа) Тогда
		Возврат КоличествоДнейОтсрочкиПлатежа;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция НайтиСПЗ(Контрагент, ДоговорТЧ)
	//СПЗ - сумма просроченной задолженности. Задолженность на дату «Поступление безналичных ДС», для которой крайняя дата оплаты (РТУ.Свойства.Срок платежа) < даты «Поступление безналичных ДС».
	СПЗ = 0;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", ДоговорТЧ);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "гф_РТУСрокПлатежа"));
	Запрос.УстановитьПараметр("ДатаПлатежа", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДополнительныеСведения.Значение, РеализацияТоваровУслуг.Дата) КАК РТУСрокПлатежа,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО (ДополнительныеСведения.Объект = РеализацияТоваровУслуг.Ссылка)
	|		И ДополнительныеСведения.Свойство = &Свойство
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|	И ЕСТЬNULL(ДополнительныеСведения.Значение, РеализацияТоваровУслуг.Дата) < &ДатаПлатежа
	|	И РеализацияТоваровУслуг.Договор = &Договор";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СПЗ;
	КонецЕсли;
	ТЗ = Результат.Выгрузить();
	Возврат ТЗ.Итог("СуммаДокумента");
КонецФункции

Функция НайтиСНПЗ(Контрагент, ДоговорТЧ, СтруктураБонусЗаРаннююОплату)
	//СНПЗ - Задолженность, у которой РТУ.Свойства.Срок платежа>= даты Поступление безналичных ДС,
	//И (РТУ.Свойства.Срок платежа - РегистрСведений.гф_ИсторияИзмененияБонусов. Пороговое значение, дни/руб) <= дата ППВ
	//ПРИМЕЧАНИЕ.
	//В запрос я сравниваю НЕ "Срок платежа - ДНИ". А "Срок платежа" с "дата ПбнДС + ДНИ",
	//т.к. тип значения "Срока платежа" на позволяет ДОБАВИТЬКДАТЕ в самом запросе
	Если СтруктураБонусЗаРаннююОплату = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	ПороговоеЗначение = СтруктураБонусЗаРаннююОплату["ПороговоеЗначение"];
	СНПЗ = 0;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", ДоговорТЧ);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "гф_РТУСрокПлатежа"));
	Запрос.УстановитьПараметр("ДатаПлатежа", Дата);
	Запрос.УстановитьПараметр("ПороговоеЗначение", ПороговоеЗначение);
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДополнительныеСведения.Значение, РеализацияТоваровУслуг.Дата) КАК РТУСрокПлатежа,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
	//|ПОМЕСТИТЬ втДанныеРТУ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО (ДополнительныеСведения.Объект = РеализацияТоваровУслуг.Ссылка)
	|		И ДополнительныеСведения.Свойство = &Свойство
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|	И ЕСТЬNULL(ДополнительныеСведения.Значение, РеализацияТоваровУслуг.Дата) >= &ДатаПлатежа
	|	И ЕСТЬNULL(ДополнительныеСведения.Значение, РеализацияТоваровУслуг.Дата) < ДОБАВИТЬКДАТЕ(&ДатаПлатежа, ДЕНЬ, &ПороговоеЗначение)
	|	И РеализацияТоваровУслуг.Договор = &Договор";
	//Результат = Запрос.Выполнить();
	//Запрос.УстановитьПараметр("ДанныеРТУ", Результат.Выгрузить());
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ДанныеРТУ.Ссылка КАК Ссылка,
	//|	ДанныеРТУ.РТУСрокПлатежа КАК РТУСрокПлатежа,
	////|	ДОБАВИТЬКДАТЕ(ДанныеРТУ.РТУСрокПлатежа, ДЕНЬ, &ПороговоеЗначение) КАК РТУСрокПлатежа_,
	////|	ДОБАВИТЬКДАТЕ(ДанныеРТУ.РТУДата, ДЕНЬ, 1) КАК РТУСрокПлатежа_,
	//|	ДанныеРТУ.СуммаДокумента КАК СуммаДокумента
	//|ПОМЕСТИТЬ втДанныеРТУ
	//|ИЗ &ДанныеРТУ КАК ДанныеРТУ";
	//Запрос.Выполнить();
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ДанныеРТУ.Ссылка КАК Ссылка,
	//|	ДанныеРТУ.РТУСрокПлатежа КАК РТУСрокПлатежа,
	//|	ДОБАВИТЬКДАТЕ(&ДатаПлатежа, ДЕНЬ, &ПороговоеЗначение) КАК ДатаПлатежа_,
	////|	ДОБАВИТЬКДАТЕ(ДанныеРТУ.РТУСрокПлатежа, ДЕНЬ, &ПороговоеЗначение) КАК РТУСрокПлатежа_,
	////|	ДОБАВИТЬКДАТЕ(ДанныеРТУ.РТУДата, ДЕНЬ, 1) КАК РТУСрокПлатежа_,
	//|	ДанныеРТУ.СуммаДокумента КАК СуммаДокумента
	//|ИЗ втДанныеРТУ КАК ДанныеРТУ";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СНПЗ;
	КонецЕсли;
	ТЗ = Результат.Выгрузить();
	Возврат ТЗ.Итог("СуммаДокумента");
КонецФункции

Функция НайтиБонусПоИстории(Сезон, Бонус)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	гф_ИсторияИзмененияБонусовСрезПоследних.Значение КАК Значение,
	|	гф_ИсторияИзмененияБонусовСрезПоследних.ПороговоеЗначение КАК ПороговоеЗначение
	|ИЗ
	|	РегистрСведений.гф_ИсторияИзмененияБонусов.СрезПоследних(&Период) КАК гф_ИсторияИзмененияБонусовСрезПоследних
	|ГДЕ
	|	гф_ИсторияИзмененияБонусовСрезПоследних.Организация = &Организация
	|	И гф_ИсторияИзмененияБонусовСрезПоследних.Сезон = &Сезон
	//|	И гф_ИсторияИзмененияБонусовСрезПоследних.Бонус = ЗНАЧЕНИЕ(Справочник.гф_ВидыБонусов.БонусЗаКурс)";
	|	И гф_ИсторияИзмененияБонусовСрезПоследних.Бонус = &Бонус";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сезон", Сезон);
	Запрос.УстановитьПараметр("Бонус", Бонус);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Значение, ПороговоеЗначение", Выборка.Значение, Выборка.ПороговоеЗначение);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

//Функция НайтиБонусЗаРаннююОплатуДни(Сезон)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	гф_ИсторияИзмененияБонусовСрезПоследних.Значение КАК Значение,
//	|	гф_ИсторияИзмененияБонусовСрезПоследних.ПороговоеЗначение КАК ПороговоеЗначение
//	|ИЗ
//	|	РегистрСведений.гф_ИсторияИзмененияБонусов.СрезПоследних(&Период) КАК гф_ИсторияИзмененияБонусовСрезПоследних
//	|ГДЕ
//	|	гф_ИсторияИзмененияБонусовСрезПоследних.Организация = &Организация
//	|	И гф_ИсторияИзмененияБонусовСрезПоследних.Сезон = &Сезон
//	|	И гф_ИсторияИзмененияБонусовСрезПоследних.Бонус = ЗНАЧЕНИЕ(Справочник.гф_ВидыБонусов.БонусЗаРаннююОплату)";
//	Запрос.УстановитьПараметр("Период", Дата);
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("Сезон", Сезон);
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Новый Структура("Значение, ПороговоеЗначение", Выборка.Значение, Выборка.ПороговоеЗначение);
//	КонецЕсли;
//	Возврат Неопределено;
//КонецФункции

Процедура ДобавитьБонусЗаРаннююОплату(СтруктураБонусЗаРаннююОплату, СтрокаТЧ, КурсВалюты, СПЗ, ДоговорТЧ)
	Если СтруктураБонусЗаРаннююОплату <> Неопределено Тогда
		//СНПЗ - Задолженность, у которой РТУ.Свойства.Срок платежа >= даты Поступление безналичных ДС,
		//И (РТУ.Свойства.Срок платежа - РегистрСведений.гф_ИсторияИзмененияБонусов. Пороговое значение, дни/руб) <= дата ППВ
		
		// vvv Галфинд \ Sakovich 16.08.2023
		//СНПЗ = НайтиСНПЗ(Контрагент, СтрокаТЧ.ОснованиеПлатежа, СтруктураБонусЗаРаннююОплату);
		СНПЗ = НайтиСНПЗ(Контрагент, ДоговорТЧ, СтруктураБонусЗаРаннююОплату);
		// ^^^ Галфинд \ Sakovich 16.08.2023
		БонусЗаРаннююОплату = (СтрокаТЧ.Сумма - СПЗ - СНПЗ) * СтруктураБонусЗаРаннююОплату.Значение / 100;
		Если БонусЗаРаннююОплату > 0 Тогда
			нз = Движения.гф_БонусыКлиентов.ДобавитьПриход();
			нз.Период = Дата;
			нз.Организация = Организация;
			нз.Контрагент = Контрагент;
			нз.Договор = ДоговорТЧ; //Изменено  Галфинд \ Sakovich 16.08.2023 11:15:48   old:<нз.Договор = СтрокаТЧ.ОснованиеПлатежа;>
			нз.ВидБонуса = Справочники.гф_ВидыБонусов.БонусЗаРаннююОплату;
			нз.Сумма = БонусЗаРаннююОплату;
			нз.КурсЕвро = КурсВалюты;
			нз.СПЗ = СПЗ;
			нз.СНПЗ = СНПЗ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьБонусЗаКурс(СтруктураБонусЗаКурс, СтрокаТЧ, КурсВалюты, СПЗ, СНПЗ, ДоговорТЧ)
	Если СтруктураБонусЗаКурс <> Неопределено Тогда
		Если КурсВалюты < СтруктураБонусЗаКурс.ПороговоеЗначение Тогда
			БонусЗаКурс = (СтрокаТЧ.Сумма - СПЗ) * СтруктураБонусЗаКурс.Значение / 100;
			Если БонусЗаКурс > 0 Тогда
				нз = Движения.гф_БонусыКлиентов.ДобавитьПриход();
				нз.Период = Дата;
				нз.Организация = Организация;
				нз.Контрагент = Контрагент;
				нз.Договор = ДоговорТЧ; //Изменено  Галфинд \ Sakovich 16.08.2023 11:21:18   old:<нз.Договор = СтрокаТЧ.ОснованиеПлатежа;>
				нз.ВидБонуса = Справочники.гф_ВидыБонусов.БонусЗаКурс;
				нз.Сумма = БонусЗаКурс;
				нз.КурсЕвро = КурсВалюты;
				нз.СПЗ = СПЗ;
				нз.СНПЗ = СНПЗ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ОпределитьДоговорКонтрагентаВСтрокеТЧ(СтрокаТЧ)
	ТипДоговорКонтрагента = Тип("СправочникСсылка.ДоговорыКонтрагентов");
	Если ТипЗнч(СтрокаТЧ["ОснованиеПлатежа"]) = ТипДоговорКонтрагента И ЗначениеЗаполнено(СтрокаТЧ["ОснованиеПлатежа"]) Тогда
		Возврат СтрокаТЧ["ОснованиеПлатежа"];
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЧ["ОбъектРасчетов"]) Тогда
		ДоговорОбъектаРасчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ["ОбъектРасчетов"], "Договор");
		Если ТипЗнч(ДоговорОбъектаРасчета) = ТипДоговорКонтрагента И ЗначениеЗаполнено(ДоговорОбъектаРасчета) Тогда
			Возврат ДоговорОбъектаРасчета;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
